IOsonata/HciController/nRF52840/src/dcd_nrf5x_hci.c
/**-------------------------------------------------------------------------
@file	dcd_nrf5x_hci.c

@brief	nRF52840 USB device controller driver for HciController.

		Implements the nRF52840 USBD hardware driver used by HciController,
		including endpoint state, EasyDMA arbitration, transfer dispatch,
		interrupt handling, Event-IN diagnostics, and the TinyUSB DCD interface.

@author	Nguyen Hoan Hoang
@date	August 2026

@license MPL-2.0, (c) 2026 I-SYST inc. See LICENSE.
----------------------------------------------------------------------------*/

/*
 * Standalone nRF52840 USBD DCD for HciController.
 *
 * TinyUSB is the USB device/class layer. This file owns the nRF52840 USBD
 * hardware driver: transfer descriptors, EasyDMA arbitration, endpoint setup,
 * endpoint transfer state, USBD interrupt dispatch, and all IRQ-side USBD
 * register sequencing. No TinyUSB portable DCD source is included here.
 */

#include "tusb_option.h"

#if CFG_TUD_ENABLED && CFG_TUSB_MCU == OPT_MCU_NRF5X

#include <inttypes.h>
#include <stdatomic.h>

#ifdef __GNUC__
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-qual"
#pragma GCC diagnostic ignored "-Wcast-align"
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wconversion"
#pragma GCC diagnostic ignored "-Wsign-conversion"
#endif

#include "nrf.h"
#include "nrf_erratas.h"

#ifdef __GNUC__
#pragma GCC diagnostic pop
#endif

#include "device/dcd.h"
#include "device/usbd_pvt.h"

enum
{
    HCI_USB_MAX_PACKET_SIZE = 64U,
    HCI_USB_EP_ISO = 8U,
    HCI_USB_EP_CBI_COUNT = 8U
};

#define HCI_USB_EDPT_END_ALL_MASK \
    ((0xFFUL << USBD_INTEN_ENDEPIN0_Pos) | \
     (0xFFUL << USBD_INTEN_ENDEPOUT0_Pos) | \
     USBD_INTEN_ENDISOIN_Msk | USBD_INTEN_ENDISOOUT_Msk)

#define HCI_USB_EVENT_IN_EP 1U
#define HCI_USB_EVENT_IN_STATUS TU_BIT(HCI_USB_EVENT_IN_EP)
#define HCI_USB_EVENT_IN_END_INT \
    TU_BIT(USBD_INTEN_ENDEPIN0_Pos + HCI_USB_EVENT_IN_EP)
#define HCI_USB_BULK_OUT_EP 2U
#define HCI_USB_BULK_OUT_STATUS USBD_EPDATASTATUS_EPOUT2_Msk
#define HCI_USB_BULK_OUT_END_INT \
    TU_BIT(USBD_INTEN_ENDEPOUT0_Pos + HCI_USB_BULK_OUT_EP)
#define HCI_USB_EVENT_ACK_TRACE_DEPTH 13U
#define HCI_USB_IRQ_EVENT_COUNT (USBD_INTEN_EPDATA_Pos + 1U)

#ifndef HCI_USB_IRQ_STORM_LIMIT
#define HCI_USB_IRQ_STORM_LIMIT 2000U
#endif

#define HCI_USB_IRQ_STORM_UNKNOWN 0x80000000UL
#define HCI_USB_EVENTCAUSE_HANDLED \
    (USBD_EVENTCAUSE_SUSPEND_Msk | USBD_EVENTCAUSE_RESUME_Msk | \
     USBD_EVENTCAUSE_USBWUALLOWED_Msk | USBD_EVENTCAUSE_ISOOUTCRC_Msk)
#define HCI_USB_ERRATA_199_REG \
    (*((volatile uint32_t *)0x40027C1CUL))

typedef struct
{
    uint8_t *pBuffer;
    uint16_t TotalLen;
    volatile uint16_t ActualLen;
    uint16_t Mps;
    volatile bool DataReceived;
    volatile bool Started;
    bool IsoInTransferReady;
} HciUsbXfer_t;

typedef struct
{
    HciUsbXfer_t Xfer[HCI_USB_EP_CBI_COUNT + 1U][2];
    bool SofEnabled;
} HciUsbDcdState_t;

static HciUsbDcdState_t s_Dcd;
static atomic_flag s_DmaRunning = ATOMIC_FLAG_INIT;

__attribute__((weak)) uint32_t HciUsbPlatformIrqEnter(void)
{
    return 1U;
}

__attribute__((weak)) void HciUsbPlatformIrqUnexpectedCause(uint32_t Cause)
{
    (void)Cause;
}

__attribute__((weak)) void HciUsbPlatformIrqStorm(uint32_t Inten,
                                                 uint32_t Cause,
                                                 uint32_t Events)
{
    (void)Inten;
    (void)Cause;
    (void)Events;
}

typedef struct
{
    uint32_t EpDataCount;
    uint32_t DmaEndCount;
    uint32_t ContinueCount;
    uint32_t CompleteCount;
    uint32_t BadAmountCount;
    uint32_t StaleStatusCount;
    uint32_t Ep2CollisionCount;
    uint32_t LateStatusCount;
    uint32_t EndOverlapCount;
    uint32_t AckTraceWrite;
    uint32_t AckTrace[HCI_USB_EVENT_ACK_TRACE_DEPTH];
} HciUsbEventInDiag_t;

static volatile HciUsbEventInDiag_t s_EventInDiag;

static inline HciUsbXfer_t *HciUsbGetXfer(uint8_t EpNum, uint8_t Dir)
{
    return &s_Dcd.Xfer[EpNum][Dir];
}

static bool HciUsbInIsr(void)
{
    return (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0U;
}

static void HciUsbRecordEventAck(const HciUsbXfer_t *pXfer,
                                 uint16_t TransferLen)
{
    if (pXfer == NULL || pXfer->pBuffer == NULL || pXfer->Mps == 0U ||
        TransferLen == 0U)
    {
        return;
    }

    uint32_t Word =
        ((uint32_t)(pXfer->ActualLen / pXfer->Mps) << 24);
    Word |= (uint32_t)pXfer->pBuffer[0];
    if (TransferLen > 1U)
    {
        Word |= (uint32_t)pXfer->pBuffer[1] << 8;
    }
    if (TransferLen > 2U)
    {
        Word |= (uint32_t)pXfer->pBuffer[2] << 16;
    }

    const uint32_t Write = s_EventInDiag.AckTraceWrite;
    s_EventInDiag.AckTrace[Write % HCI_USB_EVENT_ACK_TRACE_DEPTH] = Word;
    __DMB();
    s_EventInDiag.AckTraceWrite = Write + 1U;
}

void HciUsbPlatformReadCounters(uint32_t *pValues, size_t Count)
{
    if (pValues == NULL ||
        Count < (9U + HCI_USB_EVENT_ACK_TRACE_DEPTH))
    {
        return;
    }

    pValues[0] = s_EventInDiag.EpDataCount;
    pValues[1] = s_EventInDiag.DmaEndCount;
    pValues[2] = s_EventInDiag.ContinueCount;
    pValues[3] = s_EventInDiag.CompleteCount;
    pValues[4] = s_EventInDiag.BadAmountCount;
    pValues[5] = s_EventInDiag.StaleStatusCount;
    pValues[6] = s_EventInDiag.Ep2CollisionCount;
    pValues[7] = s_EventInDiag.LateStatusCount;
    pValues[8] = s_EventInDiag.EndOverlapCount;

    uint32_t Trace[HCI_USB_EVENT_ACK_TRACE_DEPTH];
    for (unsigned Attempt = 0U; Attempt < 3U; ++Attempt)
    {
        const uint32_t Write = s_EventInDiag.AckTraceWrite;
        __DMB();

        for (unsigned Index = 0U;
             Index < HCI_USB_EVENT_ACK_TRACE_DEPTH;
             ++Index)
        {
            Trace[Index] = 0U;
        }

        const uint32_t Available =
            Write < HCI_USB_EVENT_ACK_TRACE_DEPTH ?
            Write : HCI_USB_EVENT_ACK_TRACE_DEPTH;
        const uint32_t Padding = HCI_USB_EVENT_ACK_TRACE_DEPTH - Available;

        for (uint32_t Index = 0U; Index < Available; ++Index)
        {
            Trace[Padding + Index] =
                s_EventInDiag.AckTrace[
                    (Write - Available + Index) %
                    HCI_USB_EVENT_ACK_TRACE_DEPTH];
        }

        __DMB();
        if (s_EventInDiag.AckTraceWrite == Write)
        {
            break;
        }
    }

    for (unsigned Index = 0U;
         Index < HCI_USB_EVENT_ACK_TRACE_DEPTH;
         ++Index)
    {
        pValues[9U + Index] = Trace[Index];
    }
}

