IOsonata/HciController/nRF52840/src/dcd_nrf5x_hci.c
static void HciUsbDmaStart(volatile uint32_t *pTask)
{
    const bool NoDma =
        pTask == &NRF_USBD->TASKS_EP0STATUS ||
        pTask == &NRF_USBD->TASKS_EP0RCVOUT;

    if (!NoDma && nrf52_errata_199())
    {
        HCI_USB_ERRATA_199_REG = 0x00000082UL;
    }

    *pTask = 1U;
    __ISB();
    __DSB();

    if (NoDma)
    {
        atomic_flag_clear(&s_DmaRunning);
    }
}

static void HciUsbDmaEnd(void)
{
    if (nrf52_errata_199())
    {
        HCI_USB_ERRATA_199_REG = 0x00000000UL;
    }
    atomic_flag_clear(&s_DmaRunning);
}

static void HciUsbEdptDmaStart(volatile uint32_t *pTask);

static void HciUsbEdptDmaStartDeferred(void *pContext)
{
    HciUsbEdptDmaStart(
        (volatile uint32_t *)(uintptr_t)pContext);
}

static void HciUsbEdptDmaStart(volatile uint32_t *pTask)
{
    if (atomic_flag_test_and_set(&s_DmaRunning))
    {
        usbd_defer_func(HciUsbEdptDmaStartDeferred,
                        (void *)(uintptr_t)pTask,
                        HciUsbInIsr());
        return;
    }

    HciUsbDmaStart(pTask);
}

static void HciUsbStartOutDma(uint8_t EpNum);

static void HciUsbStartOutDmaDeferred(void *pContext)
{
    HciUsbStartOutDma((uint8_t)(uintptr_t)pContext);
}

static void HciUsbStartOutDma(uint8_t EpNum)
{
    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, TUSB_DIR_OUT);

    if (atomic_flag_test_and_set(&s_DmaRunning))
    {
        usbd_defer_func(HciUsbStartOutDmaDeferred,
                        (void *)(uintptr_t)EpNum,
                        HciUsbInIsr());
        return;
    }

    if (EpNum == HCI_USB_EP_ISO)
    {
        const uint32_t Length = NRF_USBD->SIZE.ISOOUT;
        if ((Length & USBD_SIZE_ISOOUT_ZERO_Msk) != 0U ||
            !pXfer->Started)
        {
            atomic_flag_clear(&s_DmaRunning);
            return;
        }

        NRF_USBD->ISOOUT.PTR = (uint32_t)(uintptr_t)pXfer->pBuffer;
        NRF_USBD->ISOOUT.MAXCNT = Length;
        HciUsbDmaStart(&NRF_USBD->TASKS_STARTISOOUT);
        return;
    }

    if (!pXfer->Started || pXfer->ActualLen >= pXfer->TotalLen)
    {
        pXfer->DataReceived = true;
        atomic_flag_clear(&s_DmaRunning);
        return;
    }

    const uint16_t Remaining = pXfer->TotalLen - pXfer->ActualLen;
    const uint16_t Received = (uint16_t)NRF_USBD->SIZE.EPOUT[EpNum];
    const uint16_t TransferLen =
        Received < Remaining ? Received : Remaining;

    NRF_USBD->EPOUT[EpNum].PTR =
        (uint32_t)(uintptr_t)pXfer->pBuffer;
    NRF_USBD->EPOUT[EpNum].MAXCNT = TransferLen;
    HciUsbDmaStart(&NRF_USBD->TASKS_STARTEPOUT[EpNum]);
}

static void HciUsbDrainReceivedOut(uint8_t EpNum);

static void HciUsbDrainReceivedOutDeferred(void *pContext)
{
    HciUsbDrainReceivedOut((uint8_t)(uintptr_t)pContext);
}

static void HciUsbDrainReceivedOut(uint8_t EpNum)
{
    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, TUSB_DIR_OUT);

    if (atomic_flag_test_and_set(&s_DmaRunning))
    {
        usbd_defer_func(HciUsbDrainReceivedOutDeferred,
                        (void *)(uintptr_t)EpNum,
                        HciUsbInIsr());
        return;
    }

    const uint16_t Remaining =
        pXfer->TotalLen >= pXfer->ActualLen ?
        (uint16_t)(pXfer->TotalLen - pXfer->ActualLen) : 0U;
    const uint16_t Received = (uint16_t)NRF_USBD->SIZE.EPOUT[EpNum];
    const uint16_t TransferLen =
        Received < Remaining ? Received : Remaining;

    NRF_USBD->EPOUT[EpNum].PTR =
        (uint32_t)(uintptr_t)pXfer->pBuffer;
    NRF_USBD->EPOUT[EpNum].MAXCNT = TransferLen;
    HciUsbDmaStart(&NRF_USBD->TASKS_STARTEPOUT[EpNum]);
}

static void HciUsbStartInDma(uint8_t EpNum)
{
    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, TUSB_DIR_IN);
    const uint16_t Remaining = pXfer->TotalLen - pXfer->ActualLen;
    const uint16_t TransferLen =
        Remaining < pXfer->Mps ? Remaining : pXfer->Mps;

    NRF_USBD->EPIN[EpNum].PTR =
        (uint32_t)(uintptr_t)pXfer->pBuffer;
    NRF_USBD->EPIN[EpNum].MAXCNT = TransferLen;
    HciUsbEdptDmaStart(&NRF_USBD->TASKS_STARTEPIN[EpNum]);
}

bool dcd_init(uint8_t RhPort, const tusb_rhport_init_t *pRhInit)
{
    (void)RhPort;
    (void)pRhInit;

    tu_varclr(&s_Dcd);
    atomic_flag_clear(&s_DmaRunning);
    s_Dcd.Xfer[0][TUSB_DIR_IN].Mps = HCI_USB_MAX_PACKET_SIZE;
    s_Dcd.Xfer[0][TUSB_DIR_OUT].Mps = HCI_USB_MAX_PACKET_SIZE;

    TU_LOG2("dcd init\r\n");
    return true;
}

void dcd_int_enable(uint8_t RhPort)
{
    (void)RhPort;
    NVIC_EnableIRQ(USBD_IRQn);
}

void dcd_int_disable(uint8_t RhPort)
{
    (void)RhPort;
    NVIC_DisableIRQ(USBD_IRQn);
}

void dcd_set_address(uint8_t RhPort, uint8_t DevAddr)
{
    (void)RhPort;
    (void)DevAddr;

    const uint32_t Cause = NRF_USBD->EVENTCAUSE;
    NRF_USBD->EVENTCAUSE = Cause;
    NRF_USBD->EVENTS_USBEVENT = 0U;
    NRF_USBD->INTENSET = USBD_INTEN_USBEVENT_Msk;
}

void dcd_remote_wakeup(uint8_t RhPort)
{
    (void)RhPort;
    NRF_USBD->LOWPOWER = 0U;
}

void dcd_disconnect(uint8_t RhPort)
{
    (void)RhPort;
    NRF_USBD->USBPULLUP = 0U;
    dcd_event_bus_signal(0U, DCD_EVENT_UNPLUGGED, false);
}

void dcd_connect(uint8_t RhPort)
{
    (void)RhPort;
    NRF_USBD->USBPULLUP = 1U;
}

void dcd_sof_enable(uint8_t RhPort, bool Enable)
{
    (void)RhPort;

    s_Dcd.SofEnabled = Enable;
    if (Enable)
    {
        NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
    }
    else
    {
        NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
    }
}

bool dcd_edpt_open(uint8_t RhPort,
                   const tusb_desc_endpoint_t *pDesc)
{
    (void)RhPort;

    const uint8_t EpAddr = pDesc->bEndpointAddress;
    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);

    TU_ASSERT(EpNum <= HCI_USB_EP_ISO);

    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, Dir);
    pXfer->Mps = tu_edpt_packet_size(pDesc);

    if (pDesc->bmAttributes.xfer != TUSB_XFER_ISOCHRONOUS)
    {
        TU_ASSERT(EpNum < HCI_USB_EP_CBI_COUNT);

        if (Dir == TUSB_DIR_OUT)
        {
            NRF_USBD->INTENSET =
                TU_BIT(USBD_INTEN_ENDEPOUT0_Pos + EpNum);
            NRF_USBD->EPOUTEN |= TU_BIT(EpNum);
            NRF_USBD->SIZE.EPOUT[EpNum] = 0U;
        }
        else
        {
            NRF_USBD->INTENSET =
                TU_BIT(USBD_INTEN_ENDEPIN0_Pos + EpNum);
            NRF_USBD->EPINEN |= TU_BIT(EpNum);
        }

        NRF_USBD->EPSTALL =
            (USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) |
            EpAddr;
        NRF_USBD->DTOGGLE =
            (USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) |
            EpAddr;
    }
    else
    {
        TU_ASSERT(EpNum == HCI_USB_EP_ISO);

        if (Dir == TUSB_DIR_OUT)
        {
            if (s_Dcd.Xfer[HCI_USB_EP_ISO][TUSB_DIR_IN].Mps != 0U)
            {
                NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_HalfIN;
            }

            NRF_USBD->EVENTS_ENDISOOUT = 0U;
            if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
            {
                NRF_USBD->EVENTS_SOF = 0U;
            }
            NRF_USBD->INTENSET =
                USBD_INTENSET_ENDISOOUT_Msk | USBD_INTENSET_SOF_Msk;
            NRF_USBD->EPOUTEN |= USBD_EPOUTEN_ISOOUT_Msk;
        }
        else
        {
            NRF_USBD->EVENTS_ENDISOIN = 0U;
            if (s_Dcd.Xfer[HCI_USB_EP_ISO][TUSB_DIR_OUT].Mps != 0U)
            {
                NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_HalfIN;
            }

            if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
            {
                NRF_USBD->EVENTS_SOF = 0U;
            }
            NRF_USBD->INTENSET =
                USBD_INTENSET_ENDISOIN_Msk | USBD_INTENSET_SOF_Msk;
            NRF_USBD->EPINEN |= USBD_EPINEN_ISOIN_Msk;
        }
    }

    __ISB();
    __DSB();
    return true;
}

void dcd_edpt_close_all(uint8_t RhPort)
{
    dcd_int_disable(RhPort);

    for (uint8_t EpNum = 1U;
         EpNum < HCI_USB_EP_CBI_COUNT;
         ++EpNum)
    {
        NRF_USBD->INTENCLR =
            TU_BIT(USBD_INTEN_ENDEPOUT0_Pos + EpNum) |
            TU_BIT(USBD_INTEN_ENDEPIN0_Pos + EpNum);
        NRF_USBD->TASKS_STARTEPIN[EpNum] = 0U;
        NRF_USBD->TASKS_STARTEPOUT[EpNum] = 0U;
        tu_memclr(s_Dcd.Xfer[EpNum], 2U * sizeof(HciUsbXfer_t));
    }

    NRF_USBD->INTENCLR =
        USBD_INTENCLR_SOF_Msk |
        USBD_INTENCLR_ENDISOOUT_Msk |
        USBD_INTENCLR_ENDISOIN_Msk;
    NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_OneDir;
    NRF_USBD->TASKS_STARTISOIN = 0U;
    NRF_USBD->TASKS_STARTISOOUT = 0U;
    tu_memclr(s_Dcd.Xfer[HCI_USB_EP_ISO],
              2U * sizeof(HciUsbXfer_t));

    NRF_USBD->EPOUTEN = 1UL;
    NRF_USBD->EPINEN = 1UL;

    dcd_int_enable(RhPort);
}

bool dcd_edpt_iso_alloc(uint8_t RhPort,
                        uint8_t EpAddr,
                        uint16_t LargestPacketSize)
{
    (void)RhPort;
    (void)LargestPacketSize;
    TU_ASSERT(tu_edpt_number(EpAddr) == HCI_USB_EP_ISO);
    return true;
}

bool dcd_edpt_iso_activate(uint8_t RhPort,
                           const tusb_desc_endpoint_t *pDesc)
{
    (void)RhPort;

