IOsonata/HciController/nRF52840/src/dcd_nrf5x_hci.c
    const uint8_t EpAddr = pDesc->bEndpointAddress;
    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);

    TU_ASSERT(EpNum == HCI_USB_EP_ISO);

    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, Dir);
    pXfer->Started = false;
    pXfer->DataReceived = false;
    pXfer->IsoInTransferReady = false;
    pXfer->Mps = tu_edpt_packet_size(pDesc);

    if (Dir == TUSB_DIR_OUT)
    {
        if (s_Dcd.Xfer[HCI_USB_EP_ISO][TUSB_DIR_IN].Mps != 0U)
        {
            NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_HalfIN;
        }
        NRF_USBD->EVENTS_ENDISOOUT = 0U;
        if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
        {
            NRF_USBD->EVENTS_SOF = 0U;
        }
        NRF_USBD->INTENSET =
            USBD_INTENSET_ENDISOOUT_Msk | USBD_INTENSET_SOF_Msk;
        NRF_USBD->EPOUTEN |= USBD_EPOUTEN_ISOOUT_Msk;
    }
    else
    {
        NRF_USBD->EVENTS_ENDISOIN = 0U;
        if (s_Dcd.Xfer[HCI_USB_EP_ISO][TUSB_DIR_OUT].Mps != 0U)
        {
            NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_HalfIN;
        }
        if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
        {
            NRF_USBD->EVENTS_SOF = 0U;
        }
        NRF_USBD->INTENSET =
            USBD_INTENSET_ENDISOIN_Msk | USBD_INTENSET_SOF_Msk;
        NRF_USBD->EPINEN |= USBD_EPINEN_ISOIN_Msk;
    }

    __ISB();
    __DSB();
    return true;
}

bool dcd_edpt_xfer(uint8_t RhPort,
                   uint8_t EpAddr,
                   uint8_t *pBuffer,
                   uint16_t TotalBytes,
                   bool IsIsr)
{
    (void)RhPort;
    (void)IsIsr;

    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);

    TU_ASSERT(EpNum <= HCI_USB_EP_ISO);

    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, Dir);
    TU_ASSERT(!pXfer->Started);

    if (EpAddr == (HCI_USB_EVENT_IN_EP | TUSB_DIR_IN_MASK) &&
        (NRF_USBD->EPDATASTATUS & HCI_USB_EVENT_IN_STATUS) != 0U)
    {
        s_EventInDiag.StaleStatusCount++;
        NRF_USBD->EPDATASTATUS = HCI_USB_EVENT_IN_STATUS;
        __ISB();
        __DSB();
    }

    pXfer->pBuffer = pBuffer;
    pXfer->TotalLen = TotalBytes;
    pXfer->ActualLen = 0U;

    const bool ControlStatus =
        EpNum == 0U &&
        TotalBytes == 0U &&
        Dir != tu_edpt_dir((uint8_t)NRF_USBD->BMREQUESTTYPE);

    if (ControlStatus)
    {
        dcd_event_xfer_complete(0U,
                                EpAddr,
                                0U,
                                XFER_RESULT_SUCCESS,
                                HciUsbInIsr());
        HciUsbEdptDmaStart(&NRF_USBD->TASKS_EP0STATUS);
    }
    else if (Dir == TUSB_DIR_OUT)
    {
        pXfer->Started = true;

        if (EpNum == 0U)
        {
            HciUsbEdptDmaStart(&NRF_USBD->TASKS_EP0RCVOUT);
        }
        else
        {
            __ISB();
            __DSB();

            if (pXfer->DataReceived && pXfer->Started)
            {
                pXfer->DataReceived = false;
                HciUsbStartOutDma(EpNum);
            }
        }
    }
    else
    {
        HciUsbStartInDma(EpNum);
    }

    return true;
}

void dcd_edpt_stall(uint8_t RhPort, uint8_t EpAddr)
{
    (void)RhPort;

    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);
    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, Dir);

    if (EpNum == 0U)
    {
        NRF_USBD->TASKS_EP0STALL = 1U;
    }
    else if (EpNum != HCI_USB_EP_ISO)
    {
        NRF_USBD->EPSTALL =
            (USBD_EPSTALL_STALL_Stall << USBD_EPSTALL_STALL_Pos) |
            EpAddr;

        if (Dir == TUSB_DIR_OUT && pXfer->DataReceived)
        {
            pXfer->DataReceived = false;
            HciUsbDrainReceivedOut(EpNum);
        }
    }

    __ISB();
    __DSB();
}

void dcd_edpt_clear_stall(uint8_t RhPort, uint8_t EpAddr)
{
    (void)RhPort;

    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);

    if (EpNum != 0U && EpNum != HCI_USB_EP_ISO)
    {
        NRF_USBD->DTOGGLE = EpAddr;
        NRF_USBD->DTOGGLE =
            (USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) |
            EpAddr;
        NRF_USBD->EPSTALL =
            (USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) |
            EpAddr;

        if (Dir == TUSB_DIR_OUT)
        {
            NRF_USBD->SIZE.EPOUT[EpNum] = 0U;
        }

        __ISB();
        __DSB();
    }
}

static uint32_t HciUsbCollectEvents(void)
{
    const uint32_t Inten = NRF_USBD->INTEN;
    uint32_t IntStatus = 0U;
    volatile uint32_t *pEvent = &NRF_USBD->EVENTS_USBRESET;

    for (uint8_t Index = 0U; Index < HCI_USB_IRQ_EVENT_COUNT; ++Index)
    {
        const uint32_t Mask = TU_BIT(Index);
        if ((Inten & Mask) == 0U || pEvent[Index] == 0U)
        {
            continue;
        }

        IntStatus |= Mask;
        pEvent[Index] = 0U;
        __ISB();
        __DSB();
    }

    return IntStatus;
}

static uint32_t HciUsbPendingEvents(void)
{
    uint32_t Pending = 0U;
    volatile uint32_t *pEvent = &NRF_USBD->EVENTS_USBRESET;

    for (uint8_t Index = 0U; Index < HCI_USB_IRQ_EVENT_COUNT; ++Index)
    {
        if (pEvent[Index] != 0U)
        {
            Pending |= TU_BIT(Index);
        }
    }

    return Pending;
}

static void HciUsbBusReset(void)
{
    NRF_USBD->EPOUTEN = 1UL;
    NRF_USBD->EPINEN = 1UL;

    for (uint8_t EpNum = 0U;
         EpNum < HCI_USB_EP_CBI_COUNT;
         ++EpNum)
    {
        NRF_USBD->TASKS_STARTEPIN[EpNum] = 0U;
        NRF_USBD->TASKS_STARTEPOUT[EpNum] = 0U;
    }

    NRF_USBD->TASKS_STARTISOIN = 0U;
    NRF_USBD->TASKS_STARTISOOUT = 0U;

    NRF_USBD->EVENTS_USBEVENT = 0U;
    const uint32_t Cause = NRF_USBD->EVENTCAUSE;
    NRF_USBD->EVENTCAUSE = Cause;

    NRF_USBD->INTENCLR = NRF_USBD->INTEN;
    NRF_USBD->INTENSET =
        USBD_INTEN_USBRESET_Msk |
        USBD_INTEN_USBEVENT_Msk |
        USBD_INTEN_EPDATA_Msk |
        USBD_INTEN_EP0SETUP_Msk |
        USBD_INTEN_EP0DATADONE_Msk |
        USBD_INTEN_ENDEPIN0_Msk |
        USBD_INTEN_ENDEPOUT0_Msk;

    tu_varclr(&s_Dcd);
    atomic_flag_clear(&s_DmaRunning);
    s_Dcd.Xfer[0][TUSB_DIR_IN].Mps = HCI_USB_MAX_PACKET_SIZE;
    s_Dcd.Xfer[0][TUSB_DIR_OUT].Mps = HCI_USB_MAX_PACKET_SIZE;
}

void dcd_int_handler(uint8_t RhPort)
{
    (void)RhPort;

