IOsonata/HciController/nRF52840/src/dcd_nrf5x_hci.c
    const uint32_t IntStatus = HciUsbCollectEvents();
    if (IntStatus == 0U)
    {
        return;
    }

    uint32_t EventCause = 0U;
    if ((IntStatus & USBD_INTEN_USBEVENT_Msk) != 0U)
    {
        EventCause = NRF_USBD->EVENTCAUSE;
        NRF_USBD->EVENTCAUSE = EventCause;
        __ISB();
        __DSB();

        const uint32_t Unexpected =
            EventCause & ~(uint32_t)HCI_USB_EVENTCAUSE_HANDLED;
        if (Unexpected != 0U)
        {
            HciUsbPlatformIrqUnexpectedCause(Unexpected);
        }
    }

    if ((IntStatus & HCI_USB_EVENT_IN_END_INT) != 0U)
    {
        s_EventInDiag.DmaEndCount++;
        if ((IntStatus & HCI_USB_BULK_OUT_END_INT) != 0U)
        {
            s_EventInDiag.EndOverlapCount++;
        }
    }

    if ((IntStatus & USBD_INTEN_USBRESET_Msk) != 0U)
    {
        HciUsbBusReset();
        dcd_event_bus_reset(0U, TUSB_SPEED_FULL, true);
    }

    if ((IntStatus & USBD_INTEN_ENDISOIN_Msk) != 0U)
    {
        HciUsbXfer_t *pXfer =
            HciUsbGetXfer(HCI_USB_EP_ISO, TUSB_DIR_IN);
        pXfer->ActualLen = NRF_USBD->ISOIN.AMOUNT;
        pXfer->IsoInTransferReady = true;
    }

    if ((IntStatus & USBD_INTEN_SOF_Msk) != 0U)
    {
        bool IsoEnabled = false;

        if ((NRF_USBD->EPOUTEN & USBD_EPOUTEN_ISOOUT_Msk) != 0U)
        {
            IsoEnabled = true;
            if ((IntStatus & USBD_INTEN_USBEVENT_Msk) == 0U ||
                (EventCause & USBD_EVENTCAUSE_ISOOUTCRC_Msk) == 0U)
            {
                HciUsbStartOutDma(HCI_USB_EP_ISO);
            }
        }

        if ((NRF_USBD->EPINEN & USBD_EPINEN_ISOIN_Msk) != 0U)
        {
            IsoEnabled = true;
            HciUsbXfer_t *pXfer =
                HciUsbGetXfer(HCI_USB_EP_ISO, TUSB_DIR_IN);
            if (pXfer->IsoInTransferReady)
            {
                pXfer->IsoInTransferReady = false;
                dcd_event_xfer_complete(
                    0U,
                    HCI_USB_EP_ISO | TUSB_DIR_IN_MASK,
                    pXfer->ActualLen,
                    XFER_RESULT_SUCCESS,
                    true);
            }
        }

        if (!IsoEnabled && !s_Dcd.SofEnabled)
        {
            NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
        }

        dcd_event_sof(0U, NRF_USBD->FRAMECNTR, true);
    }

    if ((IntStatus & USBD_INTEN_USBEVENT_Msk) != 0U)
    {
        TU_LOG(3, "EVENTCAUSE = 0x%04" PRIX32 "\r\n", EventCause);

        if ((EventCause & USBD_EVENTCAUSE_SUSPEND_Msk) != 0U)
        {
            NRF_USBD->LOWPOWER = 1U;
            dcd_event_bus_signal(0U, DCD_EVENT_SUSPEND, true);
        }

        if ((EventCause & USBD_EVENTCAUSE_USBWUALLOWED_Msk) != 0U)
        {
            NRF_USBD->DPDMVALUE = USBD_DPDMVALUE_STATE_Resume;
            NRF_USBD->TASKS_DPDMDRIVE = 1U;
            if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
            {
                NRF_USBD->EVENTS_SOF = 0U;
            }
            NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
        }

        if ((EventCause & USBD_EVENTCAUSE_RESUME_Msk) != 0U)
        {
            dcd_event_bus_signal(0U, DCD_EVENT_RESUME, true);
        }
    }

    if ((IntStatus & USBD_INTEN_EP0SETUP_Msk) != 0U)
    {
        const uint8_t Setup[8] =
        {
            NRF_USBD->BMREQUESTTYPE,
            NRF_USBD->BREQUEST,
            NRF_USBD->WVALUEL,
            NRF_USBD->WVALUEH,
            NRF_USBD->WINDEXL,
            NRF_USBD->WINDEXH,
            NRF_USBD->WLENGTHL,
            NRF_USBD->WLENGTHH
        };

        const tusb_control_request_t *pRequest =
            (const tusb_control_request_t *)Setup;

        if (!(TUSB_REQ_RCPT_DEVICE ==
                  pRequest->bmRequestType_bit.recipient &&
              TUSB_REQ_TYPE_STANDARD ==
                  pRequest->bmRequestType_bit.type &&
              TUSB_REQ_SET_ADDRESS == pRequest->bRequest))
        {
            dcd_event_setup_received(0U, Setup, true);
        }
    }

    if ((IntStatus & HCI_USB_EDPT_END_ALL_MASK) != 0U)
    {
        HciUsbDmaEnd();
    }

    for (uint8_t EpNum = 0U;
         EpNum < HCI_USB_EP_CBI_COUNT + 1U;
         ++EpNum)
    {
        if (!tu_bit_test(IntStatus,
                         USBD_INTEN_ENDEPOUT0_Pos + EpNum))
        {
            continue;
        }

        HciUsbXfer_t *pXfer =
            HciUsbGetXfer(EpNum, TUSB_DIR_OUT);
        if (!pXfer->Started)
        {
            continue;
        }

        const uint16_t TransferLen =
            (uint16_t)NRF_USBD->EPOUT[EpNum].AMOUNT;

        pXfer->pBuffer += TransferLen;
        pXfer->ActualLen += TransferLen;

        if (EpNum != HCI_USB_EP_ISO &&
            TransferLen == pXfer->Mps &&
            pXfer->ActualLen < pXfer->TotalLen)
        {
            if (EpNum == 0U)
            {
                HciUsbEdptDmaStart(&NRF_USBD->TASKS_EP0RCVOUT);
            }
        }
        else
        {
            pXfer->TotalLen = pXfer->ActualLen;
            pXfer->Started = false;
            dcd_event_xfer_complete(0U,
                                    EpNum,
                                    pXfer->ActualLen,
                                    XFER_RESULT_SUCCESS,
                                    true);
        }
    }

    if ((IntStatus &
         (USBD_INTEN_EPDATA_Msk | USBD_INTEN_EP0DATADONE_Msk)) != 0U)
    {
        const uint32_t DataStatus = NRF_USBD->EPDATASTATUS;
        NRF_USBD->EPDATASTATUS = DataStatus;
        __ISB();
        __DSB();

        if ((DataStatus & HCI_USB_EVENT_IN_STATUS) != 0U &&
            (DataStatus & HCI_USB_BULK_OUT_STATUS) != 0U)
        {
            s_EventInDiag.Ep2CollisionCount++;
        }

        const bool IsControlIn =
            (IntStatus & USBD_INTEN_EP0DATADONE_Msk) != 0U &&
            (NRF_USBD->BMREQUESTTYPE & TUSB_DIR_IN_MASK) != 0U;
        const bool IsControlOut =
            (IntStatus & USBD_INTEN_EP0DATADONE_Msk) != 0U &&
            (NRF_USBD->BMREQUESTTYPE & TUSB_DIR_IN_MASK) == 0U;

        if ((DataStatus & HCI_USB_BULK_OUT_STATUS) != 0U)
        {
            HciUsbXfer_t *pXfer =
                HciUsbGetXfer(HCI_USB_BULK_OUT_EP, TUSB_DIR_OUT);

            if (pXfer->Started &&
                pXfer->ActualLen < pXfer->TotalLen)
            {
                pXfer->DataReceived = false;
                HciUsbStartOutDma(HCI_USB_BULK_OUT_EP);
            }
            else
            {
                pXfer->DataReceived = true;
            }
        }

