IOsonata/HciController/nRF52840/src/dcd_nrf5x_hci.c
        for (uint8_t EpNum = 0U;
             EpNum < HCI_USB_EP_CBI_COUNT;
             ++EpNum)
        {
            if (!tu_bit_test(DataStatus, EpNum) &&
                !(EpNum == 0U && IsControlIn))
            {
                continue;
            }

            HciUsbXfer_t *pXfer =
                HciUsbGetXfer(EpNum, TUSB_DIR_IN);
            const uint8_t TransferLen =
                (uint8_t)NRF_USBD->EPIN[EpNum].AMOUNT;

            if (EpNum == HCI_USB_EVENT_IN_EP)
            {
                s_EventInDiag.EpDataCount++;

                if (pXfer->ActualLen < pXfer->TotalLen)
                {
                    const uint16_t Remaining =
                        pXfer->TotalLen - pXfer->ActualLen;
                    const uint16_t Expected =
                        Remaining < pXfer->Mps ?
                        Remaining : pXfer->Mps;
                    if (TransferLen != Expected)
                    {
                        s_EventInDiag.BadAmountCount++;
                    }
                }

                HciUsbRecordEventAck(pXfer, TransferLen);
            }

            pXfer->pBuffer += TransferLen;
            pXfer->ActualLen += TransferLen;

            if (pXfer->ActualLen < pXfer->TotalLen)
            {
                if (EpNum == HCI_USB_EVENT_IN_EP)
                {
                    s_EventInDiag.ContinueCount++;
                }
                HciUsbStartInDma(EpNum);
            }
            else
            {
                if (EpNum == HCI_USB_EVENT_IN_EP)
                {
                    s_EventInDiag.CompleteCount++;
                }
                dcd_event_xfer_complete(
                    0U,
                    EpNum | TUSB_DIR_IN_MASK,
                    pXfer->ActualLen,
                    XFER_RESULT_SUCCESS,
                    true);
            }
        }

        for (uint8_t EpNum = 0U;
             EpNum < HCI_USB_EP_CBI_COUNT;
             ++EpNum)
        {
            if (EpNum == HCI_USB_BULK_OUT_EP)
            {
                continue;
            }

            if (!tu_bit_test(DataStatus, 16U + EpNum) &&
                !(EpNum == 0U && IsControlOut))
            {
                continue;
            }

            HciUsbXfer_t *pXfer =
                HciUsbGetXfer(EpNum, TUSB_DIR_OUT);

            if (pXfer->Started &&
                pXfer->ActualLen < pXfer->TotalLen)
            {
                pXfer->DataReceived = false;
                HciUsbStartOutDma(EpNum);
            }
            else
            {
                pXfer->DataReceived = true;
            }
        }
    }
}

void USBD_IRQHandler(void)
{
    const uint32_t EntriesThisPass = HciUsbPlatformIrqEnter();
    if (EntriesThisPass == 0U)
    {
        return;
    }

    if (EntriesThisPass > HCI_USB_IRQ_STORM_LIMIT)
    {
        const uint32_t Inten = NRF_USBD->INTEN;
        const uint32_t Cause = NRF_USBD->EVENTCAUSE;
        uint32_t Events = HciUsbPendingEvents();
        if (Events == 0U)
        {
            Events = HCI_USB_IRQ_STORM_UNKNOWN;
        }

        NRF_USBD->INTEN = 0U;
        NRF_USBD->USBPULLUP = 0U;
        NVIC_DisableIRQ(USBD_IRQn);
        __ISB();
        __DSB();

        HciUsbPlatformIrqStorm(Inten, Cause, Events);
        return;
    }

    dcd_int_handler(0U);
}

void HciUsbPlatformEndpointClosed(uint8_t RhPort, uint8_t EpAddr)
{
    const uint8_t EpNum = tu_edpt_number(EpAddr);
    const uint8_t Dir = tu_edpt_dir(EpAddr);

    if (EpNum == 0U || EpNum >= HCI_USB_EP_CBI_COUNT)
    {
        return;
    }

    bool DmaEnded;
    uint32_t DataStatusBit;

    if (Dir == TUSB_DIR_OUT)
    {
        NRF_USBD->INTENCLR =
            TU_BIT(USBD_INTEN_ENDEPOUT0_Pos + EpNum);
        NRF_USBD->EPOUTEN &= ~TU_BIT(EpNum);

        DmaEnded = NRF_USBD->EVENTS_ENDEPOUT[EpNum] != 0U;
        NRF_USBD->EVENTS_ENDEPOUT[EpNum] = 0U;
        DataStatusBit = TU_BIT(16U + EpNum);
    }
    else
    {
        NRF_USBD->INTENCLR =
            TU_BIT(USBD_INTEN_ENDEPIN0_Pos + EpNum);
        NRF_USBD->EPINEN &= ~TU_BIT(EpNum);

        DmaEnded = NRF_USBD->EVENTS_ENDEPIN[EpNum] != 0U;
        NRF_USBD->EVENTS_ENDEPIN[EpNum] = 0U;
        DataStatusBit = TU_BIT(EpNum);
    }

    __ISB();
    __DSB();

    if (DmaEnded)
    {
        HciUsbDmaEnd();
    }

    NRF_USBD->EPDATASTATUS = DataStatusBit;
    __ISB();
    __DSB();

    HciUsbXfer_t *pXfer = HciUsbGetXfer(EpNum, Dir);
    pXfer->Started = false;
    pXfer->DataReceived = false;
    pXfer->IsoInTransferReady = false;

    usbd_edpt_clear_stall(RhPort, EpAddr);
}

#endif /* CFG_TUD_ENABLED && CFG_TUSB_MCU == OPT_MCU_NRF5X */
